src/Enums/ВариантыУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыУчетаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Учитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидуОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/УчетНДСПовтИсп/Ext/Module.bsl
#Область ПараметрыУчетаНДС
Функция  ВариантУчетаНДСОрганизации(Организация) Экспорт
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.НеУчитывать");
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,"ВариантУчетаНДС");
		
КонецФункции


Функция УчитыватьНДСПоВариантуУчета(ВариантУчетаНДС,ВидОплаты = Неопределено) Экспорт
	
	Если ВариантУчетаНДС  = ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.Учитывать") тогда 
		Возврат Истина
	иначеесли ВариантУчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.ПоВидуОплаты") тогда 
		Если ВидОплаты = Неопределено тогда 
			Возврат Ложь
		КонецЕсли;		
		Возврат ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыДенежныхСредств.Безналичные");
	Иначе 
		возврат Ложь
	КонецЕсли;
	
	
КонецФункции	
#КонецОбласти
